app/views/players/list.html.erb

SELECT COUNT(*) FROM `players`
SELECT `players`.* FROM `players` ORDER BY Players.created_at ASC
---

	<div><%= pluralize(@players.size, 'player') %> found </div>