app/controllers/players_controller.rb

  def list
    @players = Player.order("Players.created_at ASC")
---
SELECT `players`.* FROM `players` ORDER BY Players.created_at ASC

  def show
    @player = Player.find(params[:id])
---
SELECT `players`.* FROM `players` WHERE `players`.`id` = 1 LIMIT 1

  def create
    # Instantiate a new object using form parameters
    @player = Player.new(params[:player])
    # Save the Player
    if @player.save
---
INSERT INTO `players` (`created_at`, `email`, `paid`, `updated_at`, `username`) VALUES ('2013-01-01 19:17:32', '', 1, '2013-01-01 19:17:32', 'bullseye727')

  def edit
    @player = Player.find(params[:id])
---
SELECT `players`.* FROM `players` WHERE `players`.`id` = 5 LIMIT 1

  def update
      # find object using form parameters
     @player = Player.find(params[:id])
      # Update the Player
      if @player.update_attributes(params[:player])
---
SELECT `players`.* FROM `players` WHERE `players`.`id` = 5 LIMIT 1
UPDATE `players` SET `updated_at` = '2013-01-01 19:22:15', `paid` = 1 WHERE `players`.`id` = 5

  def delete
    @player = Player.find(params[:id])
---
SELECT `players`.* FROM `players` WHERE `players`.`id` = 1 LIMIT 1

  def destroy
    player = Player.find(params[:id])
    player.destroy
---
SELECT `players`.* FROM `players` WHERE `players`.`id` = 1 LIMIT 1
DELETE FROM `players` WHERE `players`.`id` = 1